app/views/groups/index.html.erb

SELECT COUNT(*) FROM "memberships"  WHERE "memberships"."group_id" = ?  [["group_id", 1]]
---
<h3><a href="/groups/<%=g.id%>"><%=g.name%></a></h3>
Member: <%=g.memberships.count%><br>