app/views/groups/show.html.erb

<%else%>
Created by:  <b><%=  @group.member.first_name%></b>
---
SELECT "members".* FROM "members" INNER JOIN "memberships" ON "members"."id" = "memberships"."member_id" WHERE "memberships"."group_id" = ?  [["group_id", 2]]