app/controllers/groups_controller.rb

	def index
		# @user=Member
		@groups=Group.all
---
SELECT "groups".* FROM "groups"

	def create
		g = Member.find(params[:user_id]).groups.create(name:params[:name], description:params[:description])


		if g.errors.any?
		flash[:error]=g.errors.full_messages
		redirect_to "/groups"
		else
			Membership.create(member:current_user, group:g)
---
INSERT INTO "groups" ("created_at", "description", "member_id", "name", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2016-04-14 17:39:20.494599"], ["description", "For all of those who love Hello Kitty"], ["member_id", 1], ["name", "Hello Kitty Fans"], ["updated_at", "2016-04-14 17:39:20.494599"]]
SELECT  "members".* FROM "members"  WHERE "members"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "memberships" ("created_at", "group_id", "member_id", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2016-04-14 17:39:20.508690"], ["group_id", 1], ["member_id", 1], ["updated_at", "2016-04-14 17:39:20.508690"]]

	def show
		@members = []
		@group=Group.find(params[:id])
		members=@group.members_joined
		members.each do |m|
---
SELECT  "groups".* FROM "groups"  WHERE "groups"."id" = ? LIMIT 1  [["id", 2]]
SELECT "members".* FROM "members" INNER JOIN "memberships" ON "members"."id" = "memberships"."member_id" WHERE "memberships"."group_id" = ?  [["group_id", 2]]

	def destroy
		group = Group.find(params[:id])
		group.destroy if group.member == current_user
---
SELECT  "groups".* FROM "groups"  WHERE "groups"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "groups" WHERE "groups"."id" = ?  [["id", 1]]