app/controllers/main_controller.rb

def create
	m = Member.find_by(email: params[:email])
---
SELECT  "members".* FROM "members"  WHERE "members"."email" = 'wenjie@gmail.com' LIMIT 1