app/controllers/members_controller.rb

def create
	m=Member.create(first_name:params[:first_name], last_name:params[:last_name], email:params[:email],password:params[:password])
	if m.errors.any?
---
INSERT INTO "members" ("created_at", "email", "first_name", "last_name", "password_digest", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
SELECT  1 AS one FROM "members"  WHERE LOWER("members"."email") = LOWER('wenjie@gmail.com') LIMIT 1