app/controllers/memberships_controller.rb

INSERT INTO "memberships" ("created_at", "group_id", "member_id", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2016-04-14 19:13:58.488927"], ["group_id", 3], ["member_id", 3], ["updated_at", "2016-04-14 19:13:58.488927"]]
SELECT  "groups".* FROM "groups"  WHERE "groups"."id" = ? LIMIT 1  [["id", 6]]
---
def create
	Membership.create(member:current_user, group:Group.find(params[:group_id]))

DELETE FROM "memberships" WHERE "memberships"."id" = ?  [["id", 5]]
SELECT  "members".* FROM "members"  WHERE "members"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "memberships".* FROM "memberships"  WHERE "memberships"."member_id" = 2 AND "memberships"."group_id" = 4 LIMIT 1
---
def destroy
	Membership.find_by(member: Member.find(session[:user_id]), group: Group.find(params[:group_id])).destroy